# Ultralytics YOLOv5s with CBAM

# 基于改进YOLOv5s的茶叶嫩芽分级识别方法胡和平, 吴明晖, 洪孔林, 等.基于改进YOLOv5s的茶叶嫩芽分级识别方法 [ J ] .江西农业大学学报, 2023, 45 ( 5 ) : 1261-1272.

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32
  - [232, 342, 319, 442, 503, 786] #new head

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],
    [-1, 1, Conv, [128, 3, 2]],
    [-1, 3, C3, [128]], # B1 L2

    [-1, 1, Conv, [256, 3, 2]], 
    [-1, 6, C3, [256]], # B2 L4

    [-1, 1, Conv, [512, 3, 2]],
    [-1, 9, C3, [512]], # B3 L6

    [-1, 1, Conv, [1024, 3, 2]],
    [-1, 3, C3, [1024]],
    [-1, 1, CBAM, [1024]], # B4 L10
    [-2, 1, SPPF, [1024, 5]],
    [[-1, -2], 1, Concat, [1]]
  ]

# YOLOv5 v6.0 head
head: [
    # neck
    [-1, 1, Conv, [512, 1, 1]], # N1 L12
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat with B3
    [-1, 3, C3, [512, False]], 

    [-1, 1, Conv, [256, 1, 1]], # N2 L16
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat with B2
    [-1, 3, C3, [256, False]], #

    [-1, 1, Conv, [128, 3, 1]], # N3 L20
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 2], 1, Concat, [1]], # cat with B1

    # heads
    [-1, 3, C3, [128, False]], # NP 1 L23
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 20], 1, Concat, [1]], # cat with N1

    [-1, 3, C3, [256, False]], # NP 2 L26
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 16], 1, Concat, [1]], # cat with N2

    [-1, 3, C3, [512, False]], # NP 3 L29
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 12], 1, Concat, [1]], # cat with N3

    [-1, 3, C3, [1024, False]], # NP 4 L32

    [[23, 26, 29, 32], 1, Detect, [nc, anchors]], # Detect(NPs)
  ]
