# Ultralytics YOLOv5 with CBAM

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32
  - [232, 342, 319, 442, 503, 786] #new head

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],
    [-1, 1, Conv, [128, 3, 2]],
    [-1, 3, C3, [128]], # B1 L2

    [-1, 1, Conv, [256, 3, 2]], 
    [-1, 6, C3, [256]], # B2 L4

    [-1, 1, Conv, [512, 3, 2]],
    [-1, 9, C3, [512]], # B3 L6

    [-1, 1, Conv, [1024, 3, 2]],
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]],
    [-1, 1, CBAM, [1024]] # B4 L10
  ]

# YOLOv5 v6.0 head
head: [
    # neck
    [-1, 1, Conv, [512, 1, 1]], # N1 L11
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat with B3 # ERROR in this step
    [-1, 3, C3, [512, False]], 

    [-1, 1, Conv, [256, 1, 1]], # N2 L15
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat with B2
    [-1, 3, C3, [256, False]], #

    [-1, 1, Conv, [128, 3, 1]], # N3 L19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 2], 1, Concat, [1]], # cat with B1

    # heads
    [-1, 3, C3, [128, False]], # NP 1 L22
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 19], 1, Concat, [1]], # cat with N1

    [-1, 3, C3, [256, False]], # NP 2 L25
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 15], 1, Concat, [1]], # cat with N2

    [-1, 3, C3, [512, False]], # NP 3 L28
    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]], # cat with N3

    [-1, 3, C3, [1024, False]], # NP 4 L31

    [[22, 25, 28, 31], 1, Detect, [nc, anchors]], # Detect(NPs)
  ]

# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# # Parameters
# nc: 80 # number of classes
# depth_multiple: 0.33 # model depth multiple
# width_multiple: 0.50 # layer channel multiple
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32

# # YOLOv5 v6.0 backbone
# backbone:
#   # [from, number, module, args]
#   [
#     [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
#     [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
#     [-1, 3, C3, [128]],
#     [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
#     [-1, 6, C3, [256]],
#     [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
#     [-1, 9, C3, [512]],
#     [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
#     [-1, 3, C3, [1024]],
#     [-1, 1, SPPF, [1024, 5]], # 9
#     [-1, 1, CBAM, [1024]] # B4 L10
#   ]

# # YOLOv5 v6.0 head
# head: [
#     [-1, 1, Conv, [512, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#     [[-1, 6], 1, Concat, [1]], # cat backbone P4
#     [-1, 3, C3, [512, False]], # 13

#     [-1, 1, Conv, [256, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#     [[-1, 4], 1, Concat, [1]], # cat backbone P3
#     [-1, 3, C3, [256, False]], # 17 (P3/8-small)

#     [-1, 1, Conv, [256, 3, 2]],
#     [[-1, 14], 1, Concat, [1]], # cat head P4
#     [-1, 3, C3, [512, False]], # 20 (P4/16-medium)

#     [-1, 1, Conv, [512, 3, 2]],
#     [[-1, 10], 1, Concat, [1]], # cat head P5
#     [-1, 3, C3, [1024, False]], # 23 (P5/32-large)

#     [[17, 21, 24], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
#   ]

